NguyenHoangTrieu/STM32_WB55_BLE_V2/App/BLE_Gateway/Src/at_command.c
        /* Low nibble */
        c = mac_str[i * 3U + 1U];
        if (c >= '0' && c <= '9')      lo = (uint8_t)(c - '0');
        else if (c >= 'A' && c <= 'F') lo = (uint8_t)(c - 'A' + 10);
        else if (c >= 'a' && c <= 'f') lo = (uint8_t)(c - 'a' + 10);
        else return -1;
        
        mac_bytes[i] = (hi << 4) | lo;
        
        /* Check separator (except for last byte) */
        if (i < 5U && mac_str[i * 3U + 2U] != ':') {
            return -1;
        }
    }
    
    return 0;
}

/*============================================================================
 * Event Callbacks
 *============================================================================*/

/* Deferred response tracking */
static volatile uint8_t gatt_proc_pending = 0;
static volatile uint8_t gatt_proc_error = 0;

/**
 * @brief Callback for GATT procedure complete event
 * @param conn_handle Connection handle
 * @param error_code 0 = success, non-zero = error
 * 
 * CRITICAL: This is called from BLE event context (possibly interrupt)
 * DO NOT call blocking UART functions here!
 * Instead, set flag and defer to task context.
 */
static void AT_GATT_ProcCompleteCallback(uint16_t conn_handle, uint8_t error_code)
{
    DEBUG_PRINT("AT: GATT proc complete - conn=0x%04X, err=0x%02X", conn_handle, error_code);
    
    /* Store error code and set pending flag */
    gatt_proc_error = error_code;
    gatt_proc_pending = 1;
    
    /* Schedule task to send response */
    UTIL_SEQ_SetTask(1U << CFG_TASK_AT_CMD_PROC_ID, CFG_SCH_PRIO_0);
}

/*============================================================================
 * AT Command Initialization
 *============================================================================*/
void AT_Command_Init(void)
{
    extern void BLE_EventHandler_RegisterGattProcCompleteCallback(void (*cb)(uint16_t, uint8_t));
    
    at_line_idx = 0;
    at_cmd_ready = 0;
    at_garbage_count = 0;
    at_rx_tick = 0;
    memset((void*)at_line_buf, 0, sizeof(at_line_buf));
    memset(at_cmd_buf, 0, sizeof(at_cmd_buf));
    
    /* Register GATT event callbacks */
    BLE_EventHandler_RegisterGattProcCompleteCallback(AT_GATT_ProcCompleteCallback);
    
    DEBUG_INFO("AT Command initialized");
}

/*============================================================================
 * ISR Byte Receive Handler
 * Called from LPUART1_IRQHandler - must be fast, no blocking!
 *============================================================================*/
void AT_Command_ReceiveByte(uint8_t byte)
{
    /* Check for Data Mode first */
    if (Module_Mode_GetCurrent() == MODE_DATA) {
        Module_Mode_ProcessDataByte(byte);
        
        /* Check if escape sequence detected (switched back to command mode) */
        if (Module_Mode_IsEscapeDetected()) {
             Module_Mode_EnterCommand();
             /* Clear any partial command buffer */
             at_line_idx = 0;
             at_cmd_ready = 0;
             at_garbage_count = 0;
        }
        return;
    }

    /* Increment simple tick counter */
    at_rx_tick++;
    
    /* If previous command not processed yet, drop new bytes */
    if (at_cmd_ready) {
        return;
    }
    
    /* Timeout check: reset if tick wrapped or too many ticks passed */
    if (at_line_idx > 0 && (at_rx_tick > AT_RX_TIMEOUT_MS)) {
        at_line_idx = 0;
        at_garbage_count = 0;
        at_rx_tick = 0;
    }
    
    /* Line terminator - command complete */
    if (byte == ASCII_CR || byte == ASCII_LF) {
        if (at_line_idx >= 2U) {
            at_line_buf[at_line_idx] = '\0';
            at_cmd_ready = 1;
            at_garbage_count = 0;
            at_rx_tick = 0;
            UTIL_SEQ_SetTask(1U << CFG_TASK_AT_CMD_PROC_ID, CFG_SCH_PRIO_0);
        } else {
            at_line_idx = 0;
        }
        return;
    }
    
    /* Filter: only printable ASCII */
    if (byte >= ASCII_SPACE && byte <= ASCII_TILDE) {
        if (at_line_idx < (AT_CMD_MAX_LEN - 1U)) {
            at_line_buf[at_line_idx] = (char)byte;
            at_line_idx++;
            at_rx_tick = 0;
            at_garbage_count = 0;
        }
    } else {
        at_garbage_count++;
        if (at_garbage_count > AT_MAX_GARBAGE) {
            at_line_idx = 0;
            at_garbage_count = 0;
        }
    }
}

/*============================================================================
 * Process Ready Command (called from sequencer task)
 *============================================================================*/
void AT_Command_ProcessReady(void)
{
    /* Check if GATT proc response is pending */
    if (gatt_proc_pending) {
        gatt_proc_pending = 0;
        
        /* Send final response in task context (safe for UART blocking) */
        if (gatt_proc_error == 0) {
            AT_Response_Send("OK\r\n");
        } else {
            AT_Response_Send("ERROR\r\n");
        }
        return;  /* Don't process AT command this run */
    }
    
    /* Process AT command if ready */
    if (!at_cmd_ready) {
        return;
    }
    
    /* Critical section: copy buffer then reset ISR state */
    __disable_irq();
    memcpy(at_cmd_buf, (const void*)at_line_buf, at_line_idx + 1);
    at_line_idx = 0;
    at_cmd_ready = 0;
    __enable_irq();
    
    /* Process command outside critical section */
    AT_Command_Process(at_cmd_buf);
}

/*============================================================================
 * AT Response Send (to LPUART1)
 *============================================================================*/
void AT_Response_Send(const char *fmt, ...)
{
    static char response_buf[AT_CMD_MAX_LEN];
    va_list args;
    uint16_t len;
    
    va_start(args, fmt);
    len = (uint16_t)vsnprintf(response_buf, AT_CMD_MAX_LEN, fmt, args);
    va_end(args);
    
    if (len > AT_CMD_MAX_LEN) {
        len = AT_CMD_MAX_LEN;
    }
    
    /* Send via UART - blocking */
    HAL_UART_Transmit(&hlpuart1, (uint8_t *)response_buf, len, 100);
}

/*============================================================================
 * AT Command Parser
 *============================================================================*/
void AT_Command_Process(const char *cmd_line)
{
    char cmd[AT_CMD_MAX_LEN];
    uint16_t len;
    
    if (cmd_line == NULL || cmd_line[0] == '\0') {
        return;
    }
    
